---
kind: method
id: M:Autodesk.Revit.DB.LinkLoadResult.GetExternalResourceReference
source: html/d2b5e2f8-f3b6-04bf-2a0e-8112998848a3.htm
---
# Autodesk.Revit.DB.LinkLoadResult.GetExternalResourceReference Method

Gets a copy of the ExternalResourceReference corresponding
 to the link.

## Syntax (C#)
```csharp
public ExternalResourceReference GetExternalResourceReference()
```

## Returns
A copy of the ExternalResourceReference corresponding
 to the link.